# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="path to your .css file" >
#+HTML_HEAD: <script src="path to your .js file"></script>
#+HTML_HEAD: <script type="text/javascript">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto html-preamble:t
#+TITLE: Reularization
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)

* Regularization

#+BEGIN_SRC ipython :tangle yes :session :exports code :async t :results raw drawer
    # %matplotlib inline
    import yapf
#+END_SRC

#+RESULTS:
:RESULTS:
29 - 24e44319-332b-478f-b73a-e34d2559f6d3
:END:

Regularization refers to techniques that improve the generalizability of a
trained model. In this lab, we will guide you through some common regularization
techniques such as weight decay, sparse weight, and validation.

* Learning Theory

Learning theory provides a means to understand the generalizability of trained
model. As explained in the lecture, it turns out that *model comlexity* plays a
crucial role: too simple a model leads to *high bias* and *underfitting* because
it cannot capture the trends or patterns in the underlying data generating
distribution; while too complex a model leads to *high variance* and
*overfitting* because it captures not only the trends of the underlying data
generating distribution but also some patterns local to the training data.

Let's see the problems of overfitting and underfitting from a toy regression
problem. Suppose we know the underlying data generating distribution:

$$
\mathrm{P}(\mathrm{x},
\mathrm{y})=\mathrm{P}(\mathrm{y}|\mathrm{x})\mathrm{P}(\mathrm{x}),
$$

where

$$
\mathrm{P}(\mathrm{x})\sim\mathrm{Uniform}
$$

and

$$
\mathrm{P}(\mathrm{y}|\mathrm{x})
=\sin(x) + \epsilon, \epsilon\sim\mathcal{N}(0,\sigma^2)
$$

We can generate a synthetic dataset as follows:

#+BEGIN_SRC ipython :tangle yes :session :exports code :async t :results raw drawer
    from pylab import *
    from sklearn.model_selection import train_test_split

    def gen_data(num_data, sigma):
      x = 2 * np.pi * (np.random.rand(num_data) - 0.5)
      y = np.sin(x) + np.random.normal(0, sigma, num_data)
      return (x, y)

    num_data = 30
    sigma = 0.2
    x, y = gen_data(num_data, sigma)
    x_train, x_test, y_train, y_test = train_test_split(
        x, y, test_size=0.3, random_state=0)

    plt.scatter(x_train, y_train, color='blue')
    plt.scatter(x_test, y_test, color='green')

    x_grid = np.linspace(-1 * np.pi, 1 * np.pi)
    sin_x = np.sin(x_grid)
    plt.plot(x_grid, sin_x, color='red', linewidth=2)

    plt.xlabel('x')
    plt.ylabel('y')
    plt.xlim(-np.pi, np.pi)
    plt.ylim(-2, 2)
    plt.tight_layout()
    plt.savefig('./output/fig-dataset-sin.png', dpi=300)
    plt.show()
#+END_SRC

#+RESULTS:
:RESULTS:
29 - 42a51ef6-fc4b-46ad-b707-d306596d6ff7
:END:

The blue points are training examples and the green ones are testing points. The
red curve is the $\sin$ function, which is the function $f\^*$ that has the
minimal generalization error $C[f\^*]$ (called the Bayes error).

In regression, the degree $P$ of a polynomial (polynomial regression) and the
depth of a decision tree (decision tree regression) are both hyperparameters
that relate to model complexity. Let's consider the polynomial regression here
and fit polynomials of degrees $1$, $5$, and $10$ to 20 randomly generated
training data of the same distribution:


#+BEGIN_SRC ipython :tangle yes :session :exports code :async t :results raw drawer
    from sklearn.preprocessing import PolynomialFeatures
    from sklearn.linear_model import LinearRegression
    from sklearn.metrics import r2_score

    degree = [1, 3, 10]
    std_list = []
    for d in degree:
      X_fit = np.arange(-np.pi, np.pi, .1)[:, np.newaxis]
      poly = PolynomialFeatures(degree=d)

      for i in range(20):
        x, y = gen_data(num_data, sigma)
        x_train, x_test, y_train, y_test = train_test_split(
            x, y, test_size=0.3, random_state=0)

        regr = LinearRegression()
        regr = regr.fit(
            poly.fit_transform(x_train[:, np.newaxis]), y_train[:, np.newaxis])

        y_fit = regr.predict(poly.transform(X_fit))
        plt.plot(X_fit, y_fit, color='green', lw=1)

      x_grid = np.linspace(-1 * np.pi, 1 * np.pi)
      sin_x = np.sin(x_grid)
      plt.plot(x_grid, sin_x, color='red', linewidth=2)

      plt.title('Degree: %d' % d)
      plt.xlim(-np.pi, np.pi)
      plt.ylim(-2, 2)
      plt.tight_layout()
      plt.savefig('./output/fig-polyreg-%d.png' % d, dpi=300)
      plt.show()
#+END_SRC

When $P=1$, the polynomial is too simple to capture the trend of the $\sin$
function. On the other hand, when $P=10$, the polynomial becomes too complex
such that it captures the undesirable patterns of noises.

NOTE: regression is bad at extrapolation. You can see that the shape of a fitted
polynomial differs a lot from the $\sin$ function outside the region where
training points reside.

